/**** FileVault Strings and Formatting *****/

/* The format string used to generate the text label that appears in the FileVault conversion progress window when it is showing the progress of a user's home folder getting encrypted.  The %@ is replaced by the user's full name. */
"ENCRYPTING_MESSAGE_FORMAT" = "Krypterar %@s hemmapp";

/* The format string used to generate the text label that appears in the FileVault conversion progress window when it is showing the progress of a user's home folder getting decrypted.  The %@ is replaced by the user's full name. */
"DECRYPTING_MESSAGE_FORMAT" = "Avkrypterar %@s hemmapp";

/* The format string used to generate the text label that appears in the FileVault progress window when it is showing the progress of a user's home folder getting compacted.  The %@ is replaced by the user's full name. */
"COMPACTING_MESSAGE_FORMAT" = "Återvinner utrymme i %@s hemmapp";

/* The format string used to generate the text label that appears in the FileVault progress window when it is showing the progress of a user's home folder being backed up by TimeMachine.  The %@ is replaced by the user's full name. */
"BACKINGUP_MESSAGE_FORMAT" = "Säkerhetskopierar %@s hemmapp";

"CONVERTING_MESSAGE_FORMAT" = "Konverterar %@s hemmapp";

/* The following strings appear below the progress bar in the FileVault conversion progress window to indicate the various phases of the conversion process. */
"PHASE_PREPARING" = "Förbereder...";
"PHASE_CREATING_IMAGE" = "Skapar FileVault...";
"PHASE_MOUNTING_IMAGE" = "Lägger FileVault på skrivbordet...";
"PHASE_COPYING_TO_IMAGE" = "Kopierar innehållet i hemmappen till FileVault...";
"PHASE_COPY_COMPLETE" = "Kopiering är klar...";
"PHASE_UPDATING_USER_RECORD" = "Uppdaterar användarpost...";
"PHASE_UNMOUNTING_IMAGE" = "Tar bort FileVault från skrivbordet...";
"PHASE_DELETING_OLD_HOME" = "Raderar tidigare hemmapp...";
"PHASE_SECURE_ERASING_OLD_HOME" = "Raderar den tidigare hemmappen säkert…";
"PHASE_CANCELLING" = "Avbryter...";
"PHASE_PAUSED" = "Pausad";
"PHASE_COMPACTING" = "Återvinner skivutrymme...";
"PHASE_BACKINGUP" = "Säkerhetskopierar...";

/* The following strings are time estimates that appear below the progress bar in the FileVault conversion progress window */
"TIME_EST_ESTIMATING" = "Beräknar...";
"TIME_EST_ABOUT_5_SECONDS" = "Cirka 5 sekunder";
"TIME_EST_ABOUT_10_SECONDS" = "Cirka 10 sekunder";
"TIME_EST_UNDER_A_MINUTE" = "Mindre än en minut";
"TIME_EST_ABOUT_A_MINUTE" = "Cirka en minut";
"TIME_EST_ABOUT_N_MINUTES" = "Cirka %d minuter";
"TIME_EST_ABOUT_ONE_HOUR" = "Cirka en timme";
"TIME_EST_ABOUT_ONE_HOUR_N_MINUTES" = "Cirka en timme och %d minuter";
"TIME_EST_ABOUT_PLURAL_HOURS" = "Cirka %d timmar";
"TIME_EST_ABOUT_PLURAL_HOURS_PLURAL_MINUTES" = "Cirka %1$d timmar och %2$d minuter";


"TIME_REMAINING_FORMAT" = "Återstående tid: %@";
"CANCEL_BUTTON_LABEL" = "Avbryt";

/* The following strings are used to construct the confirmation alert that is presented when a user clicks the Cancel button in the FileVault progress window. */

"CANCEL_CONFIRMATION_STOP_BUTTON" = "Avbryt";
"CANCEL_CONFIRMATION_CONTINUE_BUTTON" = "Fortsätt";
"CANCEL_ENCRYPT_CONFIRMATION_MESSAGE" = "Är du säker på att du vill avbryta FileVault?";
"CANCEL_ENCRYPT_CONFIRMATION_INFO" = "FileVault har inte slutfört krypteringen av den här hemmappen. Om du avbryter nu avaktiveras FileVault för hemmappen och den kommer inte att vara krypterad.";
"CANCEL_DECRYPT_CONFIRMATION_MESSAGE" = "Är du säker på att du vill avbryta FileVault?";
"CANCEL_DECRYPT_CONFIRMATION_INFO" = "FileVault har inte slutfört avkrypteringen av den här hemmappen. Om du avbryter nu aktiveras FileVault för hemmappen och den kommer att fortsätta vara krypterad.";

/* The following strings are used to construct the confirmation alert that is presented when a user when a compact is necessary during log out. */

"COMPACT_CONFIRMATION_CONTINUE_BUTTON" = "Fortsätt";
"COMPACT_CONFIRMATION_SKIP_NOW_BUTTON" = "Hoppa över";

"COMPACT_CONFIRMATION_MESSAGE" = "Din hemmapp, som skyddas av FileVault, använder mer skivutrymme än nödvändigt. FileVault kan återvinna detta skivutrymme. Vill du fortsätta?";

"COMPACT_CONFIRMATION_INFO" = "När du klickar på Fortsätt kommer FileVault att återvinna det oanvända skivutrymmet. Trots att processen tar ett tag så rekommenderar vi att du låter FileVault återvinna skivutrymmet nu.";


/* Error Alert strings */
"FV_ERROR_OK_BUTTON" = "OK";
"FV_ERROR_TITLE" = "Ett fel inträffade";
"FILEVAULT_ENCRYPT_ERROR_MESSAGE" = "Ett fel inträffade vid kryptering (%@). FileVault aktiveras inte för det här kontot.";
"FILEVAULT_DECRYPT_ERROR_MESSAGE" = "Ett fel inträffade vid avkryptering (%@). FileVault stängs inte av för det här kontot.";
"FV_COULD_NOT_CREATE_IMAGE" = "Kunde inte skapa FileVault-skivavbild";
"FV_COULD_NOT_CREATE_MOUNT_POINT_DIR" = "Kunde inte skapa en tillfällig katalog för inlänkningspunkt";
"FV_COULD_NOT_MOUNT_IMAGE_FOR_COPYING" = "Kunde lägga FileVault-skivavbild på skrivbordet för kopiering";
"FV_ERROR_OCCURRED_DURING_COPY" = "Ett fel inträffade vid kopiering.";
"FV_COULD_NOT_MOUNT_IMAGE_FOR_VERIFICATION" = "Kunde inte lägga FileVault-skivavbild på skrivbordet för kontroll";
"FV_VERIFICATION_FAILED" = "Kontrollen misslyckades";
"FV_COULD_NOT_UNMOUNT_IMAGE" = "Kunde inte ta bort FileVault-skivavbild från skrivbordet";
"FV_ERROR_DEFAULT" = "Fel %d";

"FV_SECURE_ERASE_FINISHED_TITLE" = "Din tidigare hemmapp har raderats säkert.";
"FV_SECURE_ERASE_FINISHED_INFO" = "FileVault-skydd har aktiverats för ditt konto och innehållet i hemmappen har krypterats.";
"FV_SECURE_ERASE_FAILED_TITLE" = "Ett problem uppstod vid säker radering av den tidigare hemmappen under FileVault-konverteringsprocessen.";
"FV_SECURE_ERASE_FAILED_INFO" = "Den säkra raderingsprocessen misslyckades innan den tidigare hemmappen kunde raderas helt.";
"FV_CONTINUE_TITLE" = "Är du säker på att du vill fortsätta radera din tidigare hemmapp i bakgrunden?";
"FV_CONTINUE_INFO" = "Om du klickar på ”OK” fortsätter FileVault att säkert radera din tidigare hemmapp medan du arbetar. Du kan kontrollera raderingsstatusen i panelen Säkerhet i Systeminställningar.";